# Дано расстояние L в сантиметрах. Используя операцию деления нацело, найти количество полных метров в нем (1 метр =100 см).
# Ввод расстояния в сантиметрах
L = input("Введите расстояние в сантиметрах: ")
while type(L) != int:
    try:
        L = int(L)
    except ValueError:
        print("Неправильно ввели")
        L = input("Введите расстояние в сантиметрах: ")
    if L >= 0:
        # Находим количество полных метров
        meters = L // 100

        # Вывод количества полных метров
        print("Количество полных метров:", meters)
        break
    else:
        print("Ошибка: введите корректное неотрицательное число")
