# Дано расстояние L в сантиметрах. Используя операцию деления нацело, найти количество полных метров в нем (1 метр =100 см).
while True:
    try:
        while True:
            # Ввод расстояния в сантиметрах
            L = int(input("Введите расстояние в сантиметрах: "))
            if L >= 0:
                # Находим количество полных метров и остаток сантиметров
                meters, centimetrs = divmod(L, 100)
                # Вывод количества полных метров
                print("Количество полных метров: ", meters)
                break #Конец внутреннего цикла
            else:
                print("Ошибка: введите корректное неотрицательное число")
    except ValueError:
        print("Ошибка: введите целое число")
        continue
    break
